Revit 2024 API
ExportLinetypeTableIterator.MoveNext Method
 Increments the iterator to the next item.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public virtual bool MoveNext()
Visual Basic
Public Overridable Function MoveNext As Boolean
Visual C++
public:
virtual bool MoveNext()
Return Value
 True if the iteration has no more items. False if there are more items to be iterated.
See Also
ExportLinetypeTableIterator Class
Autodesk.Revit.DB Namespace